Tekla Open API Reference for Tekla Structures 2025
Plane.AxisY Property
 The Y-axis of the plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector AxisY { get; set; }
Public Property AxisY As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
Plane Class
Tekla.Structures.Model Namespace